# MassGBXMLExportOptions Properties (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
MassGBXMLExportOptions Properties
MassGBXMLExportOptions Class See Also
---
The MassGBXMLExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace